export const TooltipsText = {
  nameProjects: {
    title: 'Совет',
    body: [
      {
        subtitle: 'Название',
        text: [
          'Формула «Объект + Контекст» — например, «Разработка современного интернет-магазина бытовой утвари и аксессуаров»',
        ]
      },
    ]
  },
  shortDescriptionProjects: {
    title: 'Совет',
    body: [
      {
        subtitle: 'Краткое описание',
        text: [
          'Формула «[Название] — это [тип продукта] для [ЦА], который помогает [решить главную проблему]',
        ]
      },
    ]
  },
  prerequisites: {
    title: 'Совет',
    body: [
      {
        subtitle: 'Предпосылки',
        text: [
          'Опишите текущую проблему, статистику или изменения на рынке, которые делают этот проект актуальным именно сейчас.',
        ]
      },
    ]
  },
  productVision: {
    title: 'Совет',
    body: [
      {
        subtitle: 'Product Vision',
        text: [
          'Формула — «Для [кого создан продукт], который [какую проблему испытывает], [наш товар] — это [что это такое], который [как помогает], в отличие от [конкурента или альтернативы], наш товар [чем мы лучше или чем отличаемся]',
        ]
      },
    ]
  },
  projectGoals : {
    title: 'Совет',
    body: [
      {
        subtitle: 'Цели проекта',
        text: [
          'Сформулируйте 1–3 предложения о том, что именно изменится в жизни пользователя после запуска',
        ]
      },
    ]
  },
  businessGoal : {
    title: 'Совет',
    body: [
      {
        subtitle: 'Цели бизнеса',
        text: [
          'Например, «Снижение затрат на поддержку на 20%» или «Привлечение 100 новых платящих пользователей»',
        ]
      },
    ]
  },
  keyRequirements : {
    title: 'Совет',
    body: [
      {
        subtitle: 'Ключевой функционал',
        text: [
          'Формат «Сущность + Действие», например «Фильтрация товаров по цене и категории»',
        ]
      },
    ]
  },
  functionalRequirements : {
    title: 'Совет',
    body: [
      {
        subtitle: 'Функциональные требования',
        text: [
          'Формат «Система должна [действие] при условии [событие]»',
        ]
      },
    ]
  },
  nonFunctionalRequirements : {
    title: 'Совет',
    body: [
      {
        subtitle: 'Нефункциональные требования',
        text: [
          'Укажите конкретные параметры: «Время отклика < 2 сек», «Поддержка iOS 15+», «Шифрование данных по ГОСТ»',
        ]
      },
    ]
  },
  targetAuditory : {
    title: 'Совет',
    body: [
      {
        subtitle: 'Целевая аудитория',
        text: [
          'Укажите основные характеристики и поведенческие паттерны',
        ]
      },
    ]
  },
  problemStatement : {
    title: 'Совет',
    body: [
      {
        subtitle: 'Постановка задачи',
        text: [
          'Технические ограничения, исторические данные или пошаговый план реализации, предоставленные компанией.',
        ]
      },
    ]
  },
  businessMetrics : {
    title: 'Совет',
    body: [
      {
        subtitle: 'Бизнес-метрики',
        text: [
          'Укажите LTV, CAC, Retention или специфические продуктовые метрики (например, конверсию в покупку)',
        ]
      },
    ]
  },
  projectPlan : {
    title: 'Совет',
    body: [
      {
        subtitle: 'План проекта',
        text: [
          'Формат «[Название этапа] — [Ожидаемый результат]», например «1. Прототипирование — кликабельный макет в Figma»',
        ]
      },
    ]
  },
  checkpoints : {
    title: 'Ключевые точки проекта',
    body: [
      {
        text: [
          'Базовые этапы фиксированы для учебного процесса. Ментор может добавлять собственные промежуточные точки контроля.',
        ]
      },
    ]
  },
  resources : {
    title: 'Ресурсы',
    body: [
      {
        text: [
          'Ресурсы и ссылки к необходимым платформам для создания или управления проектом',
        ]
      },
    ]
  },
}